### Import the pandas Library

In [1]:
import pandas as pd

In [2]:
data = {'name': ['Rishi', 'Ajit', 'Amit', 'Arpit', 'Amy'], 
        'year': [2013, 2014, 2013, 2014, 2014], 
        'cgpa': [4.1, 4.3, 3.1, 2.9, 3.5],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['apple', 'banana', 'orange', 'pineapple', 'plum'])
df

           cgpa  coverage   name  year
apple       4.1        25  Rishi  2013
banana      4.3        94   Ajit  2014
orange      3.1        57   Amit  2013
pineapple   2.9        62  Arpit  2014
plum        3.5        70    Amy  2014

### Fetch the rows with a values of 'name' column as Rishi

In [3]:
df[df['name'].map(lambda label: 'Rishi' in label)]

       cgpa  coverage   name  year
apple   4.1        25  Rishi  2013

### Convet int column to string before applying lamba Expression

In [4]:
df['year']= df['year'].astype('str')

### Fetch the rows with a values of 'year' column as 2014

In [5]:
df[df['year'].map(lambda label: '2014' in label)]

           cgpa  coverage   name  year
banana      4.3        94   Ajit  2014
pineapple   2.9        62  Arpit  2014
plum        3.5        70    Amy  2014

In [ ]:
df['name'].map(lambda name: 'Rishi' in name)